kiffie/pic32-pac/pic32mx2xx/pic32mx1x4fxxxb/PIC32MX174F256B.svd
        <register>
          <name>ALRMDATECLR</name>
          <description>ALRMDATECLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMDATESET</name>
          <description>ALRMDATESET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMDATEINV</name>
          <description>ALRMDATEINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR1</name>
      <description>TMR1 peripheral</description>
      <baseAddress>0xbf800600</baseAddress>
      <registers>
        <register>
          <name>T1CON</name>
          <description>T1CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TECS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CONCLR</name>
          <description>T1CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TECS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CONSET</name>
          <description>T1CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TECS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CONINV</name>
          <description>T1CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TECS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1</name>
          <description>TMR1 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1CLR</name>
          <description>TMR1CLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1SET</name>
          <description>TMR1SET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1INV</name>
          <description>TMR1INV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1</name>
          <description>PR1 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>65535</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1CLR</name>
          <description>PR1CLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1SET</name>
          <description>PR1SET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1INV</name>
          <description>PR1INV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
