kiffie/pic32-pac/pic32mx2xx/pic32mx1x4fxxxb/PIC32MX174F256B.svd
        <register>
          <name>IFS1INV</name>
          <description>IFS1INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PMPIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CTMUIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0</name>
          <description>IEC0 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0CLR</name>
          <description>IEC0CLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0SET</name>
          <description>IEC0SET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0INV</name>
          <description>IEC0INV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
