kiffie/pic32-pac/pic32mx2xx/pic32mx1x4fxxxb/PIC32MX174F256B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTA</name>
      <description>PORTA peripheral</description>
      <baseAddress>0xbf886000</baseAddress>
      <registers>
        <register>
          <name>ANSELA</name>
          <description>ANSELA register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>3</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELACLR</name>
          <description>ANSELACLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELASET</name>
          <description>ANSELASET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELAINV</name>
          <description>ANSELAINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISA</name>
          <description>TRISA register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>31</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISACLR</name>
          <description>TRISACLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISASET</name>
          <description>TRISASET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISAINV</name>
          <description>TRISAINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTA</name>
          <description>PORTA register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTACLR</name>
          <description>PORTACLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTASET</name>
          <description>PORTASET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTAINV</name>
          <description>PORTAINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATA</name>
          <description>LATA register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATACLR</name>
          <description>LATACLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATASET</name>
          <description>LATASET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATAINV</name>
          <description>LATAINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCA</name>
          <description>ODCA register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCACLR</name>
          <description>ODCACLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCASET</name>
          <description>ODCASET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCAINV</name>
          <description>ODCAINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUA</name>
          <description>CNPUA register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUACLR</name>
          <description>CNPUACLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUASET</name>
          <description>CNPUASET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUAINV</name>
          <description>CNPUAINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDA</name>
          <description>CNPDA register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDACLR</name>
          <description>CNPDACLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDASET</name>
          <description>CNPDASET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDAINV</name>
          <description>CNPDAINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONA</name>
          <description>CNCONA register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONACLR</name>
          <description>CNCONACLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
